<template>
  <div class="terms-and-conditions">
    <MainCube color="pink" left="25%" top="12%" width="large" height="xx-large" />
    <MainCube color="green" left="20%" top="15%" width="xxxx-large" height="large" />
    <MainCube color="pink" left="16%" top="72%" width="large" height="large" />
    <MainCube color="pink" left="13%" top="75%" width="large" height="large" />
    <MainCube color="green" left="15%" top="73%" width="medium" height="medium" />
    <MainCube color="green" left="75%" top="43%" width="large" height="large" />
    <MainCube color="green" left="78%" top="45%" width="medium" height="medium" />
    <MainCube color="green" right="0%" top="25%" width="small" height="xx-large" />
    <MainCube color="pink" right="0%" top="28%" width="xxx-large" height="medium" />
    <MainCube color="pink" right="12%" top="84%" width="large" height="xxx-large" />

    <div class="terms-and-conditions-content width--page-size margin--auto">
      <h2 class="text--dark title--large">
        תנאי שימוש האתר
      </h2>
      <br>
      <p class="text--dark">
        לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית גולר מונפרר סוברט לורם שבצק יהול,
        לכנוץ בעריר גק ליץ, ושבעגט ליבם סולגק.
        <br>
        <br>
        בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
        לורם איפסום דולור סיט אמט, נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף.
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>
        <br>
        וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קולהע צופעט למרקוח איבן איף,
        ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.
        <br>
        תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה.
        <br>
        <br>
        
        לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית גולר מונפרר סוברט לורם שבצק יהול,
        לכנוץ בעריר גק ליץ, ושבעגט ליבם סולגק.
        <br>
        בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
        לורם איפסום דולור סיט אמט, נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף.
        <br>
        
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>

        וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קולהע צופעט למרקוח איבן איף,
        <br>
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>
        <br>
        וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קולהע צופעט למרקוח איבן איף,
        ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.
        <br>
        תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה.
        <br>
        <br>
        
        לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית גולר מונפרר סוברט לורם שבצק יהול,
        לכנוץ בעריר גק ליץ, ושבעגט ליבם סולגק.
        <br>
        בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
        לורם איפסום דולור סיט אמט, נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף.
        <br>
        
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>
        <br>
        וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קולהע צופעט למרקוח איבן איף,
        ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.
        <br>
        תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה.
        <br>
        <br>
        
        לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית גולר מונפרר סוברט לורם שבצק יהול,
        לכנוץ בעריר גק ליץ, ושבעגט ליבם סולגק.
        <br>
        בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
        לורם איפסום דולור סיט אמט, נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף.
        <br>
        
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>
        <br>
        וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קולהע צופעט למרקוח איבן איף,
        ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.
        <br>
        תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה.
        <br>
        <br>
        
        לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית גולר מונפרר סוברט לורם שבצק יהול,
        לכנוץ בעריר גק ליץ, ושבעגט ליבם סולגק.
        <br>
        בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
        לורם איפסום דולור סיט אמט, נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף.
        <br>
        
        <br>
        אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית.
        סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם.
        <br>
      </p>
    </div>
  </div>
</template>

<script lang="ts">
import MainCube from '@/components/library/background/MainCube.vue';
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'TermsAndConditionsView',

  components: {
    MainCube,
  },

  data() {
    return {
    };
  },

  methods: {

  }
});
</script>

<style lang="scss" scoped>
.terms-and-conditions {
  height: 100vh;
  min-height: fit-content;
}

.terms-and-conditions-content {
  position: relative;
  z-index: 2;
  margin-top: 5%;
}
</style>
